package org.example;
import org.example.units.BaseHero;
/**
 * Арбалетчик, Маг, Манах, Крестьянин, Вор, Снайпер, Копьеносец
 *
 * 1 копьеносец: колет копьем, ходит, защищается.Свойства: сила удара 5, расстояние удара 2м,
 * здоровье 100, скорость атаки 3, уровень персонажа 1
 *
 * 1 Арбалетчик: стреляет болтами, берет болты у крестьянина, зарядка арбалета. Свойства: урон 100,
 * дальность,  здоровье, скорость атаки, уровень персонажа
 *
 * 1 Маг: лечит, колдует. Свойства: урон колдовства, здоровье, скорость колдовства, уровень интеллекта,
 * апгрейд уровня другого персонажа
 *
 * 2 Манах: лечит, колдует. Свойства: урон колдовства, здоровье, скорость колдовства, уровень интеллекта,
 * апгрейд уровня другого персонажа
 *
 * 1,2 Крестьянин: подносит стрелы и болты, . Свойства: здоровье, уровень интеллекта,
 *
 * 2 Снайпер: стреляет стрелами, берет стрелы у крестьянина, зарядка лука. Свойства: урон ,
 *  * дальность,  здоровье, скорость атаки, уровень персонажа
 *
 * 2 Вор: колет ножом, ходит, прячется.Свойства: сила удара 3, расстояние удара 1м,
 *  * здоровье 90, скорость атаки 5, уровень персонажа 1
 *
 */
public class Main {
    public static void main(String[] args) {
        BaseHero hero = new BaseHero();
        hero.
    }

}