package ms.aoe;

public enum NamesGood {
    Бажен, Беловолод, Белогор, Белозар, Беломир, Белослав, Белотур, Благомир, Благослав, Благояр, Богдан, Богород, 
    Богумил, Богумир, Боеслав, Божеслав, Болеслав, Боримир, Бориполк, Борис, Борислав, Братимир, Братислав, 
    Бретислав, Бронислав, Будимир, Будислав, Буеслав, Бурислав, Василько, Вацлав, Ведагор, Ведамир, Ведислав, 
    Велеслав, Велибор, Велимир, Венцеслав, Витослав, Владимир, Владислав, Властислав, Воибор, Воисвет, Воислав, 
    Всеволод, Всемил, Всеслав, Вышеслав, Вячеслав, Годимир, Годислав, Горисвет, Горислав, Гостимир, Гостислав, 
    Гостомысл, Градимир, Гремислав, Далебор, Данислав, Данияр, Даромир, Даромысл, Дивислав, Добран, Добровит, 
    Доброслав, Добрыня, Драговит, Драголюб, Драгомир, Драгорад, Есислав, Желан, Зареслав, Збыслав, Звенимир, 
    Зданимир, Здеслав, Златодан, Златослав, Изяслав, Истислав, Казимир, Колояр, Красибор, Красимир, Ладимир, Ладислав, 
    Лучезар, Любим, Любодар, Любомил, Любомир, Люборад, Людмил, Мечислав, Милан, Милован, Милорад, Милослав, Мирогнев, 
    Миродар, Миролюб, Мирослав, Млад, Мстислав, Новомир, Огнедар, Огнеслав, Орислав, Остромир, Остромысл, Первослав, 
    Пересвет, Переслав, Премислав, Путислав, Радим, Радимил, Радимир, Радислав, Радомир, Радосвет, Ратибор, Ратимир, 
    Ратислав, Ратмир, Родислав, Родомир, Ростислав, Светислав, Световид, Светогор, Светолик, Светомир, Светополк, 
    Светослав, Святогор, Святополк, Святослав, Станимир, Станислав, Судислав, Таислав, Твердислав, Творимир, Тихомир, 
    Хотомир, Хранимир, Хранислав, Честимир, Яромир, Ярополк, Ярослав

}
