package ms.aoe;

public enum NamesBad {
    Воланд, Саурон, Вейдер, Лютор, Джокер, Ханнибал, Танос, Палпатин, Мориарти, Магнето, 
    Кайзер, Маньяк, Грубиян, Падль, Иуда, Упырь, Чикатило, Ганнибал, Грязный, Наполеон, Адольф, Гитлер, Бенладен, 
    Саддам, Пабло, Потороха, Воробей, Демон, Промокашка, Чужой, Зодиак, Мокрица, Фриц, Ганс, Смит, Кайло, Хеллбой, 
    Крюгер, Джейсон, Горбатый, Лектер, Хайд, Дракула, Локи, Кикимора, Голлум, Волдеморт, Спидоза, Байден, Удод, 
    Киллер, Клоун , Каратель , Стукач , Веном , Драчун , Чума , Гамбит , Барбаросса, Яга, Кощей, Баюн, 
    Соловей, Волчара, Водяной, Леший, Колдун, Морда, Мамба, Рейген, Чурка, Миледи, Огрызок, 
    Фрекен, Гадюка, Горыныч
}
